Yourigh/A_light/3 - FW SW/2 - Alarm Clock FW ESP8266/_190104_ESP8266_Alight_gitted/src/Alight_main.cpp
  delay(100);
  if (!mdns.begin("Alight",ip)) {
    PRINTDEBUG("\nError setting up MDNS responder! deadlock, restarting");
    LED_blink_all(leds,20,CRGB::Red);
    program_restart();
    }
  PRINTDEBUG("\nmDNS responder started");
  // Start the server
  server.begin();
  mdns.addService("http","tcp",80);
  PRINTDEBUG("\nServer started");
  delay(100);
}


void req_inter(String in) //split recevied string to command and value and put to global buffers
{
  int i = 0;
  // Read each command pair
  // Length (with one extra character for the null terminator)
  int str_len = in.length() + 1;

  // Prepare the character array (the buffer)
  char input[str_len];

  // Copy it over
  in.toCharArray(input, str_len);
  char* command = strtok(input, "&");
  while (command != 0)
  {
    // Split the command in two values
    char* separator = strchr(command, '=');
    if (separator != 0)
    {
      // Actually split the string in 2: replace ':' with 0
      *separator = 0;
      req_name_buf[i] = command; //write command to this GLOBAL buffer
      ++separator;
      req_value_buf[i++] = separator; //value to this GLOBAL buffer
    }
    // Find the next command in input string
    command = strtok(0, "&");
  }
}

void http_update_handle(String req) {
  String t = "/a?";
  req = req.substring(t.length());
  req_inter(req);
  PRINTDEBUG(req_name_buf[0]);
  PRINTDEBUG(req_value_buf[0]);
  t_httpUpdate_return ret = ESPhttpUpdate.update(req_value_buf[0]);
  switch (ret) {
    case HTTP_UPDATE_FAILED:
      Serial.printf("HTTP_UPDATE_FAILD Error (%d): %s", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
      break;

    case HTTP_UPDATE_NO_UPDATES:
      PRINTDEBUG("HTTP_UPDATE_NO_UPDATES");
      break;

    case HTTP_UPDATE_OK:
      PRINTDEBUG("HTTP_UPDATE_OK");
      break;
  }
}

int mdns1(int webtype, String WifiList) //main web function that do everything. responds to requests etc..
//if returned OK_VAL, everything is ok, ERROR_VAL is bad
{
  // Check for any mDNS queries and send responses
  mdns.update();
  WiFiClient client = server.available();
  if (!client) {
    return OK_VAL;
  }
  PRINTDEBUG("");
  PRINTDEBUG("\n\nNew client request: ");
  String req = client.readStringUntil('\r');
  PRINTDEBUG(req);
  // Wait for data from client to become available
  if (client.connected() && !client.available()) {
    PRINTDEBUG("\nGone");
    return OK_VAL;
  }

  // Read the first line of HTTP request

  // First line of HTTP request looks like "GET /path HTTP/1.1"
  // Retrieve the "/path" part by finding the spaces
  int addr_start = req.indexOf(' ');
  int addr_end = req.indexOf(' ', addr_start + 1);
  if (addr_start == -1 || addr_end == -1) {
    Serial.print("\nInvalid request: ");
    PRINTDEBUG(req);
    return OK_VAL;
  }
  req = req.substring(addr_start + 1, addr_end);
  Serial.print("\nRequest: ");
  PRINTDEBUG(req);
  client.flush();

  String s;
  int commaIndex[6];
  String temp;
  

  if ( webtype == 1 ) {
    PRINTDEBUG(req);
    if (req == "/")
    {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>A_light";
      s += "<p>";
      s += "<form method='get' action='a'><label>SSID: </label><input name='ssid' length=32><label><br><br>PASS: </label><input name='pass' length=64><label><br><br><input type='submit'><br><br>";
      s += WifiList;
      s += "</form>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      LED_blink_all(leds,1,CRGB::Blue);
    }
    else if ( req.startsWith("/a?ssid=") ) {
      String t = "/a?";
      req = req.substring(t.length());
      req_inter(req);
      for (int i = 0; i < 2; i++)
      {
        PRINTDEBUG("\n");
        PRINTDEBUG(req_name_buf[i]);
        PRINTDEBUG(": ");
        PRINTDEBUG(req_value_buf[i]);
      }

      String qsid = req_value_buf[0];
      String qpass = req_value_buf[1];

      if (qsid.length()<2)
      {
        PRINTDEBUG("\nSSID entered is too short! values are not changed");
        //message stating credentials saved with restart button
        s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>Local ";
        s += "WiFi credentials NOT saved! (SSID too short)<br><br><a href=\"";
        s += "restart";
        s += "\"><button>Restart!</button></a>";
        s += "<p></p></html>\r\n\r\n";
        LED_blink_all(leds,1,CRGB::Red);
      }else{
        qsid = special_char_fix(qsid);
        qpass = special_char_fix(qpass);
        
        PRINTDEBUG("\nclearing eeprom 0 - 127 index");
        for (unsigned int i = 0; i < 127; ++i) {
          EEPROM.write(i, 0);
        }
        PRINTDEBUG("\neeprom cleared");
        delay(5);
        PRINTDEBUG("\nwriting eeprom ssid:");
        for (byte i = 0; i < qsid.length(); ++i)
        {
          EEPROM.write(i, qsid[i]);
          PRINTDEBUG(qsid[i]);
        }
        PRINTDEBUG("\nwriting eeprom pass:");
        for (byte i = 0; i < qpass.length(); ++i)
        {
          EEPROM.write(32 + i, qpass[i]);
          PRINTDEBUG(qpass[i]);
        }
        EEPROM.commit();
        //message stating credentials saved with restart button
        s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>Local WiFi credentials saved!<br><br><a href=\"";
        s += "restart";
        s += "\"><button>Restart!</button></a>";
        s += "<p></p></html>\r\n\r\n";
        LED_blink_all(leds,2,CRGB::Green); 
      }
    }
    else if ( req.startsWith("/cleareeprom") ) {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>EEPROM cleared!<br><br><a href=\"";
      s += "restart";
      s += "\"><button>Restart!</button></a>";
      s += "<p></p></html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      PRINTDEBUG("\nclearing eeprom");
      for (int i = 0; i < 512; ++i) {
        EEPROM.write(i, 0);
      }
      EEPROM.commit();
      LED_blink_all(leds,1,CRGB::Green);
    }
    else if (req.startsWith("/a?update="))
    {
      http_update_handle(req);
    }
    else if ( req.startsWith("/restart") ) {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>A_light";
      s += "<p>Restarting...<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      PRINTDEBUG("\nRestarting");
      client.print(s); //because it won't run in the end of this IF statements
      if (WiFi.status() == WL_CONNECTED)  WiFi.disconnect();
      delay(100);
      LED_blink_all(leds,1,CRGB::Yellow);
      program_restart();
    }
    else if ( req.startsWith("/wifioff")) {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>A_light";
      s += "<p>Wifi Turning off, no wireless in summer mode, restart for connection...<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      PRINTDEBUG("\nWifi off");
      client.print(s); //because it won't run in the end of this IF statements
      if (WiFi.status() == WL_CONNECTED)  WiFi.disconnect();
      WiFi.mode( WIFI_OFF );
      WiFi.forceSleepBegin();
      delay(100);
      LED_blink_all(leds,1,CRGB::Green);
      summer_mode=true;
    }
    else
    {
      s = "HTTP/1.1 404 Not Found\r\n\r\n";
      PRINTDEBUG("\nSending 404");
      LED_blink_all(leds,1,CRGB::Red);  //get rid of this maybe, because browser asks for an icon every load and it is error
    }
  }
  else //web type 0 is when connected to local wifi
  {
    if (req == "/")
    {     
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>A-Light active<br><a href=\"";
      s += "summertime_on\">Turn on summer time (UTC+2)</a><br><a href=\"";
      s += "summertime_off\">Turn off summer time (UTC+1)</a><br><a href=\"";
      s += "restart\">Device restart</a><br><a href=\"";
      s += "wifioff\">Summer mode (no WiFi untul restart)</a><br><a href=\"";
      s += "cleareeprom\">Clear eeprom - remove all settings!</a><br>";
      s += "<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      LED_blink_all(leds,1,CRGB::Blue);
    }
    else if ( req.startsWith("/cleareeprom") ) {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>EEPROM cleared!<br><br><a href=\"";
      s += "restart";
      s += "\"><button>Restart!</button></a>";
      s += "<p></p></html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      PRINTDEBUG("\nClearing eeprom");
      for (int i = 0; i < 512; ++i) {
        EEPROM.write(i, 0);
      }
      EEPROM.commit();
      LED_blink_all(leds,1,CRGB::Green);
    }
    else if ( req.startsWith("/restart") ) {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>A_light";
      s += "<p>Restarting...<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      PRINTDEBUG("\nRestarting");
      client.print(s); //because it won't run in the end of this IF statements
      if (WiFi.status() == WL_CONNECTED)  WiFi.disconnect();
      delay(100);
      LED_blink_all(leds,1,CRGB::Yellow);
      program_restart();
    }
    else if ( req.startsWith("/wifioff")) {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>A_light";
      s += "<p>Wifi Turning off, no wireless in summer mode, restart for connection...<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      PRINTDEBUG("\nWifi off");
      client.print(s); //because it won't run in the end of this IF statements
      if (WiFi.status() == WL_CONNECTED)  WiFi.disconnect();
      WiFi.mode( WIFI_OFF );
      WiFi.forceSleepBegin();
      delay(100);
      LED_blink_all(leds,1,CRGB::Green);
      summer_mode=true;
    }
    else if ( req.startsWith("/summertime_on") ) {
      timeClient.setTimeOffset(7200);
      EEPROM.write(SUMMERTIME_MEMORY_OFFSET, 0b1);
      EEPROM.commit();
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>UTC+2 selected<br>";
      s += "<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      LED_blink_all(leds,1,CRGB::Purple);
    }
    else if ( req.startsWith("/summertime_off") ) {
      timeClient.setTimeOffset(3600);
      EEPROM.write(SUMMERTIME_MEMORY_OFFSET, 0b0);
      EEPROM.commit();
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>UTC+1 selected<br>";
      s += "<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      LED_blink_all(leds,1,CRGB::Purple);
    }
    else if ( req.startsWith("/a?update=") ) {
      http_update_handle(req); //idk what is going on here
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>HTTP updated<p>";
      s += String(1);
      s += "</p></html>\r\n\r\n";
    }
    //Responses to time commands
    else if ( req.startsWith("/?SYN") ) { //Sync   //Example: SYN,08+20+2016,09:28:56,1

      commaIndex[0] = req.indexOf(','); //first Index
      commaIndex[1] = req.indexOf(',',commaIndex[0]+1); //next 5 commas
      tm.Month = req.substring(commaIndex[0]+1, commaIndex[0]+3).toInt();
      temp = req.substring(commaIndex[0]+4, commaIndex[0]+6);
      tm.Day = temp.toInt();
      temp = req.substring(commaIndex[0]+9, commaIndex[0]+11);
      tm.Year = temp.toInt(); //years from 2000, set time function needs 2019 or 19.
      temp = req.substring(commaIndex[1]+1, commaIndex[1]+3);
      tm.Hour = temp.toInt();
      temp = req.substring(commaIndex[1]+4, commaIndex[1]+6);
      tm.Minute = temp.toInt();
      temp = req.substring(commaIndex[1]+7, commaIndex[1]+9);
      tm.Second = temp.toInt();
      temp = req.substring(commaIndex[1]+10);
      tm.Wday = temp.toInt();

      /*#if not defined(RTC_DS1307) || defined(RTC_DS3231)
        setTime(tm.Hour,tm.Minute,tm.Second,tm.Day,tm.Month,tm.Year);
      #endif*/
      //run always, not only when no RTC is defined. Helps time library recognize that time is set.
      setTime(tm.Hour,tm.Minute,tm.Second,tm.Day,tm.Month,tm.Year);
      
      #ifdef RTC_DS3231
        Clock.setClockMode(false);  // set to 24h
        Clock.setYear(tm.Year);
        Clock.setMonth(tm.Month);
        Clock.setDate(tm.Day);
        Clock.setDoW(tm.Wday);
        Clock.setHour(tm.Hour);
        Clock.setMinute(tm.Minute);
        Clock.setSecond(tm.Second);
      #endif
      #ifdef RTC_DS1307
        Rtc.SetDateTime(RtcDateTime(tm.Year,tm.Month,tm.Day,tm.Hour,tm.Minute,tm.Second)); //needs year as 2019 or 19
        if (!Rtc.GetIsRunning())
        {
          Rtc.SetIsRunning(true);
        }
      #endif
      
      time_show(clock_face_rotation,0);
      
